docs/diagrams/sequence_diagram.mmd
sequenceDiagram
    participant C_0004125011841911275123 as AppManager
    * ->> C_0004125011841911275123 : AppManager(QObject *)
    activate C_0004125011841911275123
    participant C_0004909201866089141242 as UIManager
    C_0004125011841911275123 ->> C_0004909201866089141242 : getInstance(QObject *)
    activate C_0004909201866089141242
    C_0004909201866089141242 ->> C_0004909201866089141242 : UIManager(QObject *)
    activate C_0004909201866089141242
    participant C_0000524940392191554637 as ResponseManager
    C_0004909201866089141242 ->> C_0000524940392191554637 : ResponseManager(QObject *)
    activate C_0000524940392191554637
    deactivate C_0000524940392191554637
    participant C_0017581648629732253705 as RequestManager
    C_0004909201866089141242 ->> C_0017581648629732253705 : getInstance(QObject *)
    activate C_0017581648629732253705
    C_0017581648629732253705 ->> C_0017581648629732253705 : RequestManager(QObject *)
    activate C_0017581648629732253705
    deactivate C_0017581648629732253705
    C_0017581648629732253705 -->> C_0004909201866089141242 : 
    deactivate C_0017581648629732253705
    C_0004909201866089141242 ->> C_0004909201866089141242 : createLoginWidget()
    activate C_0004909201866089141242
    alt
    participant C_0009314656593254540318 as LoginWidget
    C_0004909201866089141242 ->> C_0009314656593254540318 : LoginWidget(QWidget *)
    activate C_0009314656593254540318
    C_0009314656593254540318 ->> C_0017581648629732253705 : getInstance(QObject *)
    activate C_0017581648629732253705
    C_0017581648629732253705 -->> C_0009314656593254540318 : 
    deactivate C_0017581648629732253705
    deactivate C_0009314656593254540318
    end
    deactivate C_0004909201866089141242
    deactivate C_0004909201866089141242
    C_0004909201866089141242 -->> C_0004125011841911275123 : 
    deactivate C_0004909201866089141242
    participant C_0003891570225386253038 as ClientHandler
    C_0004125011841911275123 ->> C_0003891570225386253038 : ClientHandler(QObject *)
    activate C_0003891570225386253038
    deactivate C_0003891570225386253038
    deactivate C_0004125011841911275123

%% Generated with clang-uml, version 0.5.3
%% LLVM version clang version 18.1.1 (https://github.com/llvm/llvm-project.git dba2a75e9c7ef81fe84774ba5eee5e67e01d801a)
