docs/diagrams/sequence_diagram.puml
@startuml
participant "AppManager" as C_0004125011841911275123
[-> C_0004125011841911275123 : AppManager(QObject *)
activate C_0004125011841911275123
participant "UIManager" as C_0004909201866089141242
C_0004125011841911275123 -> C_0004909201866089141242 : __getInstance(QObject *)__
activate C_0004909201866089141242
C_0004909201866089141242 -> C_0004909201866089141242 : UIManager(QObject *)
activate C_0004909201866089141242
participant "ResponseManager" as C_0000524940392191554637
C_0004909201866089141242 -> C_0000524940392191554637 : ResponseManager(QObject *)
activate C_0000524940392191554637
deactivate C_0000524940392191554637
participant "RequestManager" as C_0017581648629732253705
C_0004909201866089141242 -> C_0017581648629732253705 : __getInstance(QObject *)__
activate C_0017581648629732253705
C_0017581648629732253705 -> C_0017581648629732253705 : RequestManager(QObject *)
activate C_0017581648629732253705
deactivate C_0017581648629732253705
C_0017581648629732253705 --> C_0004909201866089141242
deactivate C_0017581648629732253705
C_0004909201866089141242 -> C_0004909201866089141242 : createLoginWidget()
activate C_0004909201866089141242
alt
participant "LoginWidget" as C_0009314656593254540318
C_0004909201866089141242 -> C_0009314656593254540318 : LoginWidget(QWidget *)
activate C_0009314656593254540318
C_0009314656593254540318 -> C_0017581648629732253705 : __getInstance(QObject *)__
activate C_0017581648629732253705
C_0017581648629732253705 --> C_0009314656593254540318
deactivate C_0017581648629732253705
deactivate C_0009314656593254540318
end
deactivate C_0004909201866089141242
deactivate C_0004909201866089141242
C_0004909201866089141242 --> C_0004125011841911275123
deactivate C_0004909201866089141242
participant "ClientHandler" as C_0003891570225386253038
C_0004125011841911275123 -> C_0003891570225386253038 : ClientHandler(QObject *)
activate C_0003891570225386253038
deactivate C_0003891570225386253038
deactivate C_0004125011841911275123

'Generated with clang-uml, version 0.5.3
'LLVM version clang version 18.1.1 (https://github.com/llvm/llvm-project.git dba2a75e9c7ef81fe84774ba5eee5e67e01d801a)
@enduml
